In [2]:
import pandas as pd
from pandas import DataFrame
a=DataFrame([
              [19,14,18,19],
              [18,10,17,16],
              [17,16,18,15]
            ],columns =["OSA","JAVA","SE","DS"])
a

   OSA  JAVA  SE  DS
0   19    14  18  19
1   18    10  17  16
2   17    16  18  15

In [3]:
a.sum()

OSA     54
JAVA    40
SE      53
DS      50
dtype: int64

In [4]:
a.max()

OSA     19
JAVA    16
SE      18
DS      19
dtype: int64

In [5]:
a.min()

OSA     17
JAVA    10
SE      17
DS      15
dtype: int64

In [6]:
a.mean()

OSA     18.000000
JAVA    13.333333
SE      17.666667
DS      16.666667
dtype: float64

In [7]:
a.count()

OSA     3
JAVA    3
SE      3
DS      3
dtype: int64

In [9]:
a.first()

TypeError: first() missing 1 required positional argument: 'offset'

In [10]:
a.describe()

        OSA       JAVA         SE         DS
count   3.0   3.000000   3.000000   3.000000
mean   18.0  13.333333  17.666667  16.666667
std     1.0   3.055050   0.577350   2.081666
min    17.0  10.000000  17.000000  15.000000
25%    17.5  12.000000  17.500000  15.500000
50%    18.0  14.000000  18.000000  16.000000
75%    18.5  15.000000  18.000000  17.500000
max    19.0  16.000000  18.000000  19.000000

# aggregation method example

In [13]:
a.agg(["sum","min","max","std","count"])

        OSA      JAVA        SE         DS
sum    54.0  40.00000  53.00000  50.000000
min    17.0  10.00000  17.00000  15.000000
max    19.0  16.00000  18.00000  19.000000
std     1.0   3.05505   0.57735   2.081666
count   3.0   3.00000   3.00000   3.000000

In [15]:
import pandas as pd
from pandas import DataFrame
df1 = DataFrame([
                 ["Aryan","Singh","Full Time","administration",2,20000],
                 ["Rohan","Agarwal","Intern","Technical",3,5000],
                 ["Riya","Shah","Full Time","administration",5,10000],
                 ["Yash","Bhatia","Part Time","Technical",7,10000],
                 ["Siddant","Khanna","Full Time","Management",6,20000]
    
                 
               ],columns = ["First Name","Last Name","Type","Department","yoE","Salary"])
df1

  First Name Last Name       Type      Department  yoE  Salary
0      Aryan     Singh  Full Time  administration    2   20000
1      Rohan   Agarwal     Intern       Technical    3    5000
2       Riya      Shah  Full Time  administration    5   10000
3       Yash    Bhatia  Part Time       Technical    7   10000
4    Siddant    Khanna  Full Time      Management    6   20000

In [22]:
df1.groupby(["Type"]).sum()

           yoE  Salary
Type
Full Time   13   50000
Intern       3    5000
Part Time    7   10000

In [23]:
df1.groupby(["Type"]).mean()

                yoE        Salary
Type
Full Time  4.333333  16666.666667
Intern     3.000000   5000.000000
Part Time  7.000000  10000.000000

In [24]:
df1.groupby(["Type","Department"]).sum()

                          yoE  Salary
Type      Department
Full Time Management        6   20000
          administration    7   30000
Intern    Technical         3    5000
Part Time Technical         7   10000

In [25]:
df1.groupby(["Department","Type"]).sum()

                          yoE  Salary
Department     Type
Management     Full Time    6   20000
Technical      Intern       3    5000
               Part Time    7   10000
administration Full Time    7   30000